{
  "backend/main.mo": "Motoko canister storing per‑user fruit analysis results with access‑controlled save and history retrieval.",
  "feature_evidence.json": "Feature‑evidence report mapping feature IDs to affected frontend files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind base config defining OKLCH color variables, theming for light/dark modes, and core utility styles.",
  "frontend/index.html": "Root HTML shell loading the React application entrypoint.",
  "frontend/src/App.tsx": "Main React app orchestrating upload, multi‑step analysis, results display, history loading, and authentication state.",
  "frontend/src/components/AnalysisProgress.tsx": "Component showing step‑based analysis progress with icons, statuses, and error display.",
  "frontend/src/components/AuthBar.tsx": "Authentication UI handling login/logout via Internet Identity with loading and state handling.",
  "frontend/src/components/Footer.tsx": "Simple footer with attribution and styled branding.",
  "frontend/src/components/FruitImageUploader.tsx": "Handles image upload via drag-and-drop, paste, or file input, validates images, and triggers analysis actions.",
  "frontend/src/components/FruitInfoCard.tsx": "Displays descriptive fruit information such as varieties, storage, ripeness, and taste based on the detected fruit type.",
  "frontend/src/components/Header.tsx": "Renders the top navigation header with app branding and authentication controls.",
  "frontend/src/components/HistoryPanel.tsx": "Shows saved analysis history, allows saving new results, clearing history, and selecting past entries with auth gating.",
  "frontend/src/components/ResultsPanel.tsx": "Displays analysis output including fruit type, freshness category, confidence scores, and expandable explanation details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for history retrieval, saving analysis results, and clearing cached history, plus converters for fruit types and result entries.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme CSS variables, including light/dark palettes and a subtle background pattern utility.",
  "frontend/src/lib/fruitInfo.ts": "Contains a static database of fruit descriptions, varieties, taste, storage guidelines, and ripeness indicators.",
  "frontend/src/lib/imageAnalysis.ts": "Implements browser‑based image analysis to classify fruit and estimate freshness using color statistics from canvas processing.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, supporting hash‑based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, shadows, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current build state, existing feature set, and requirements for a browser‑based fruit image classification app with freshness assessment and optional result storage. Contains metadata, versioning, and a list of implemented features without architectural notes or issues."
}